docs/tutorials/GENTLE_INTRODUCTION_TYPES_SPECS_SESSIONS.org
#+TITLE: A Gentle Introduction to Prologos: Types, Specs, and Sessions
#+SUBTITLE: For Programmers Who Ship Code — A Spiral Curriculum
#+AUTHOR: Prologos Project
#+DATE: 2026-02-24

#+begin_quote
"The language is actually designed to be minimal in ceremony and syntax,
and look friendly and inviting to any programmer generally familiar with
functional programming; although there are layers of depth to unlock
further expressiveness, if they choose to go there."
#+end_quote

* Who This Is For

You write JavaScript or TypeScript. You've shipped production services.
You might know about capability-based security from the OCapN community,
or about distributed systems from building real infrastructure. You've
heard terms like "dependent types" and "session types" but they sound
academic.

This tutorial shows you that Prologos's type system is /not/ academic.
It's a pragmatic tool for catching bugs you've been catching with tests,
conventions, and code review. You can use as little or as much of it as
you want --- the layers are opt-in.

*Prerequisites:* Familiarity with a typed language (TypeScript, Java, Rust)
and comfort with first-class functions (=map=, =filter=, =reduce=).

*What you won't need:* Category theory, proof assistants, Greek letters,
or a PhD.


* Spiral 1: Just Write Functions

** 1.1 Your First Prologos Function

#+begin_src prologos
defn greet [name]
  [string-append "Hello, " name]
#+end_src

That's it. No type annotations. Prologos infers that =name= is a =String=
and the return value is a =String=. If you've used TypeScript with
=noImplicitAny= off, this feels familiar --- write code, let the system
figure out the types.

Key syntax note: =[]= is for function application. =defn greet [name]=
defines a function =greet= that takes =name=. =[string-append "Hello, " name]=
calls =string-append= with two arguments.

** 1.2 Pattern Matching

#+begin_src prologos
defn factorial
  | [0] -> 1
  | [n] -> [* n [factorial [- n 1]]]
#+end_src

The =|= arms define cases directly on the function — no separate
=match= expression needed. Brackets =[...]= are for function calls.
This reads naturally: "factorial of 0 is 1; factorial of n is n times
factorial of (n - 1)."

** 1.3 Collections Work Like You'd Expect

#+begin_src prologos
;; List literal
def xs '[1 2 3 4 5]

;; PVec (persistent vector -- like Clojure's vectors)
def ys @[10 20 30]

;; Map (persistent hash map)
def user {:name "Alice" :age 30}

;; Set (persistent hash set)
def primes #{2 3 5 7}

;; Generic operations work on ALL of them
map inc xs                      ;; => '[2 3 4 5 6]
map inc ys                      ;; => @[11 21 31]
filter [fn [x] [> x 3]] xs      ;; => '[4 5]
reduce + 0 xs                   ;; => 15
into @[] xs                     ;; => @[1 2 3 4 5]  (List -> PVec)
#+end_src

=map=, =filter=, =reduce= work generically on Lists, PVecs, Sets ---
any collection type. If you've used Clojure's seq abstraction or
Rust's iterators, this is the same idea: one set of function names,
all collection types, type-preserving.


* Spiral 2: Adding Type Signatures with =spec=

** 2.1 Why Bother?

Type inference is great for small functions. But as code grows, explicit
type signatures become /documentation that the compiler checks/. TypeScript
developers know this instinct --- you /could/ let TS infer everything, but
=: number= on a function parameter prevents a whole class of bugs.

In Prologos, type signatures live in =spec= declarations --- separate from
the function body. Think of =spec= as TypeScript's =interface= for a
single function:

** 2.2 Level 1: Simple Types

#+begin_src prologos
spec add : Int Int -> Int
defn add [x y] [+ x y]
#+end_src

Read this as: "=add= takes an =Int= and an =Int= and returns an =Int=."
Arrow =(->)= separates arguments from return type.

This is the equivalent of TypeScript's:
#+begin_src typescript
function add(x: number, y: number): number { ... }
#+end_src

