docs/tutorials/GENTLE_INTRODUCTION_TYPES_SPECS_SESSIONS.tex
% Created 2026-02-24 Tue 07:58
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Prologos Project}
\date{2026-02-24}
\title{A Gentle Introduction to Prologos: Types, Specs, and Sessions\\\medskip
\large For Programmers Who Ship Code — A Spiral Curriculum}
\hypersetup{
 pdfauthor={Prologos Project},
 pdftitle={A Gentle Introduction to Prologos: Types, Specs, and Sessions},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.39)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\begin{quote}
"The language is actually designed to be minimal in ceremony and syntax,
and look friendly and inviting to any programmer generally familiar with
functional programming; although there are layers of depth to unlock
further expressiveness, if they choose to go there."
\end{quote}
\section{Who This Is For}
\label{sec:org2d614a5}

You write JavaScript or TypeScript. You've shipped production services.
You might know about capability-based security from the OCapN community,
or about distributed systems from building real infrastructure. You've
heard terms like "dependent types" and "session types" but they sound
academic.

This tutorial shows you that Prologos's type system is \emph{not} academic.
It's a pragmatic tool for catching bugs you've been catching with tests,
conventions, and code review. You can use as little or as much of it as
you want --- the layers are opt-in.

\textbf{Prerequisites:} Familiarity with a typed language (TypeScript, Java, Rust)
and comfort with first-class functions (\texttt{map}, \texttt{filter}, \texttt{reduce}).

\textbf{What you won't need:} Category theory, proof assistants, Greek letters,
or a PhD.
\section{Spiral 1: Just Write Functions}
\label{sec:org6a284aa}

\subsection{1.1 Your First Prologos Function}
\label{sec:orga48c313}

\begin{verbatim}
defn greet [name]
  [string-append "Hello, " name]
\end{verbatim}

That's it. No type annotations. Prologos infers that \texttt{name} is a \texttt{String}
and the return value is a \texttt{String}. If you've used TypeScript with
\texttt{noImplicitAny} off, this feels familiar --- write code, let the system
figure out the types.

Key syntax note: \texttt{[]} is for function application. \texttt{defn greet [name]}
defines a function \texttt{greet} that takes \texttt{name}. \texttt{[string-append "Hello, " name]}
calls \texttt{string-append} with two arguments.
\subsection{1.2 Pattern Matching}
\label{sec:org8844493}

\begin{verbatim}
defn factorial
  | [0] -> 1
  | [n] -> [* n [factorial [- n 1]]]
\end{verbatim}

The \texttt{|} arms define cases directly on the function — no separate
\texttt{match} expression needed. Brackets \texttt{[...]} are for function calls.
This reads naturally: "factorial of 0 is 1; factorial of n is n times
factorial of (n - 1)."
\subsection{1.3 Collections Work Like You'd Expect}
\label{sec:orgb71ab58}

\begin{verbatim}
;; List literal
def xs '[1 2 3 4 5]

;; PVec (persistent vector -- like Clojure's vectors)
def ys @[10 20 30]

;; Map (persistent hash map)
def user {:name "Alice" :age 30}

;; Set (persistent hash set)
def primes #{2 3 5 7}

;; Generic operations work on ALL of them
map inc xs                      ;; => '[2 3 4 5 6]
map inc ys                      ;; => @[11 21 31]
filter (fn [x] [> x 3]) xs     ;; => '[4 5]
reduce + 0 xs                   ;; => 15
into @[] xs                     ;; => @[1 2 3 4 5]  (List -> PVec)
\end{verbatim}

\texttt{map}, \texttt{filter}, \texttt{reduce} work generically on Lists, PVecs, Sets ---
any collection type. If you've used Clojure's seq abstraction or
Rust's iterators, this is the same idea: one set of function names,
all collection types, type-preserving.
\section{Spiral 2: Adding Type Signatures with \texttt{spec}}
\label{sec:org35472c1}

\subsection{2.1 Why Bother?}
\label{sec:orge42f79d}

Type inference is great for small functions. But as code grows, explicit
type signatures become \emph{documentation that the compiler checks}. TypeScript
developers know this instinct --- you \emph{could} let TS infer everything, but
\texttt{: number} on a function parameter prevents a whole class of bugs.

In Prologos, type signatures live in \texttt{spec} declarations --- separate from
the function body. Think of \texttt{spec} as TypeScript's \texttt{interface} for a
single function:
\subsection{2.2 Level 1: Simple Types}
\label{sec:orgf2e1eac}

\begin{verbatim}
spec add : Int -> Int -> Int
defn add [x y] [+ x y]
\end{verbatim}

Read this as: "\texttt{add} takes an \texttt{Int} and an \texttt{Int} and returns an \texttt{Int}."
Arrow \texttt{(->)} separates arguments from return type.

This is the equivalent of TypeScript's:
\begin{verbatim}
function add(x: number, y: number): number { ... }
\end{verbatim}
