docs/tutorials/GENTLE_INTRODUCTION_TYPES_SPECS_SESSIONS.tex
\subsection{2.3 Level 2: Generics (Polymorphism)}
\label{sec:org8ce224b}

\begin{verbatim}
spec id : A -> A
defn id [x] x
\end{verbatim}

\texttt{A} is a type variable --- just like TypeScript's \texttt{<T>}. Prologos infers
that \texttt{A} is a type parameter because it appears free in the signature
(starts with a capital letter, not a known type). No need to write the
equivalent of \texttt{<A>}.

TypeScript equivalent:
\begin{verbatim}
function id<A>(x: A): A { return x; }
\end{verbatim}
\subsection{2.4 Level 3: Constrained Generics}
\label{sec:org65b026d}

What if your generic function needs the type to support certain operations?

\begin{verbatim}
spec sort : [List A] -> [List A]
  :where (Ord A)
defn sort [xs] ...
\end{verbatim}

\texttt{:where (Ord A)} means "\texttt{A} must support ordering." This is like
TypeScript's \texttt{<A extends Comparable<A>{}>{}} but more flexible --- traits
(Prologos's version of interfaces) are resolved automatically.

The user writes \texttt{sort '[3 1 2]} --- the compiler sees \texttt{A = Int},
finds \texttt{Int}'s \texttt{Ord} instance, and passes it in automatically. Zero
ceremony at the call site.
\section{Spiral 3: \texttt{spec} as Self-Documenting Metadata}
\label{sec:orge4889e0}

\subsection{3.1 Beyond Types: Specs as Rich Descriptions}
\label{sec:org93b4305}

Here's where Prologos diverges from TypeScript. A \texttt{spec} isn't \emph{just} a
type signature --- it's a structured metadata record. You can attach
documentation, examples, and properties \emph{right next to the type}:

\begin{verbatim}
spec sort : [List A] -> [List A]
  :where (Ord A)
  :doc "Sort a list in ascending order using merge sort"
  :examples
    - [sort '[3 1 2]] => '[1 2 3]
    - [sort '[]] => '[]
  :properties
    - :name "preserves-length"
      :holds [eq? [length [sort xs]] [length xs]]
    - :name "idempotent"
      :holds [eq? [sort [sort xs]] [sort xs]]
\end{verbatim}

Let's break this down:

\begin{center}
\begin{tabular}{lll}
Key & What it does & Analogy\\
\hline
\texttt{:doc} & Human-readable description & JSDoc \texttt{@description}\\
\texttt{:examples} & Concrete input/output pairs & Jest \texttt{test("should...")}\\
\texttt{:properties} & Universal invariants (for all valid inputs) & QuickCheck / fast-check property\\
\texttt{:where} & Trait constraints (interfaces the type must have) & TS \texttt{extends} constraint\\
\end{tabular}
\end{center}
\subsection{3.2 Why This Matters}
\label{sec:org1f962fa}

In JavaScript, these live in \emph{four different places}:

\begin{enumerate}
\item Types: TypeScript \texttt{.d.ts} files or inline annotations
\item Docs: JSDoc comments (often stale)
\item Examples: Unit tests in a separate \texttt{*.test.js} file
\item Properties: Property-based tests in a third file (if you have them at all)
\end{enumerate}

In Prologos, they're \emph{all part of the spec}. The compiler reads them.
The tooling reads them. They're always in sync because they live next to
the function they describe.
\subsection{3.3 The Graduation Path}
\label{sec:org472063f}

This is the key design philosophy: \textbf{you opt in to more precision}. Each
level adds information without changing the previous levels:

\begin{verbatim}
;; Level 0: No types at all. Inference does the work.
defn add [x y] [+ x y]

;; Level 1: Add a type signature.
spec add : Int -> Int -> Int
defn add [x y] [+ x y]

;; Level 2: Add documentation.
spec add : Int -> Int -> Int
  :doc "Integer addition"
defn add [x y] [+ x y]

;; Level 3: Add examples.
spec add : Int -> Int -> Int
  :doc "Integer addition"
  :examples
    - [add 2 3] => 5
defn add [x y] [+ x y]

;; Level 4: Add properties.
spec add : Int -> Int -> Int
  :doc "Integer addition"
  :examples
    - [add 2 3] => 5
  :properties
    - :name "commutative"
      :holds [eq? [add x y] [add y x]]
    - :name "identity"
      :holds [eq? [add x 0] x]
defn add [x y] [+ x y]
\end{verbatim}

At no point do you need to understand dependent types, Pi types, or
category theory. You're just adding metadata that the compiler checks.

\textbf{The implementation doesn't change.} Only the specification becomes richer.
\section{Spiral 4: Higher-Kinded Types (Without the Jargon)}
\label{sec:orgbd77094}

\subsection{4.1 The Problem: Writing Generic Code Over Containers}
\label{sec:org3ee614a}

You know \texttt{map} works on arrays in JavaScript. But what if you want to
write a function that works on \emph{any container} --- arrays, Sets, Maps,
async iterables --- without knowing which one?

In TypeScript, this is awkward. You'd need overloads or a complex generic:

\begin{verbatim}
// TypeScript: you end up with overloads
function fmap<A, B>(f: (a: A) => B, xs: Array<A>): Array<B>;
function fmap<A, B>(f: (a: A) => B, xs: Set<A>): Set<B>;
// ... one per container type
\end{verbatim}
