docs/tutorials/GENTLE_INTRODUCTION_TYPES_SPECS_SESSIONS.md


<a id="orgb1303ac"></a>

## 2.3 Level 2: Generics (Polymorphism)

```prologos
spec id : A -> A
defn id [x] x
```

`A` is a type variable &#x2014; just like TypeScript's `<T>`. Prologos infers that `A` is a type parameter because it appears free in the signature (starts with a capital letter, not a known type). No need to write the equivalent of `<A>`.

TypeScript equivalent:

```typescript
function id<A>(x: A): A { return x; }
```


<a id="org05cd61a"></a>

## 2.4 Level 3: Constrained Generics

What if your generic function needs the type to support certain operations?

```prologos
spec sort : [List A] -> [List A]
  :where (Ord A)
defn sort [xs] ...
```

`:where (Ord A)` means "`A` must support ordering." This is like TypeScript's `<A extends Comparable<A>>` but more flexible &#x2014; traits (Prologos's version of interfaces) are resolved automatically.

The user writes `sort '[3 1 2]` &#x2014; the compiler sees `A = Int`, finds `Int`'s `Ord` instance, and passes it in automatically. Zero ceremony at the call site.


<a id="org6a020c9"></a>

# Spiral 3: `spec` as Self-Documenting Metadata


<a id="org78ea03a"></a>

## 3.1 Beyond Types: Specs as Rich Descriptions

Here's where Prologos diverges from TypeScript. A `spec` isn't *just* a type signature &#x2014; it's a structured metadata record. You can attach documentation, examples, and properties *right next to the type*:

```prologos
spec sort : [List A] -> [List A]
  :where (Ord A)
  :doc "Sort a list in ascending order using merge sort"
  :examples
    - [sort '[3 1 2]] => '[1 2 3]
    - [sort '[]] => '[]
  :properties
    - :name "preserves-length"
      :holds [eq? [length [sort xs]]
                  [length xs]]
    - :name "idempotent"
      :holds [eq? [sort [sort xs]]
                  [sort xs]]
```

Let's break this down:

| Key           | What it does                                      | Analogy                          |
|------------- |------------------------------------------------- |-------------------------------- |
| `:doc`        | Human-readable description                        | JSDoc `@description`             |
| `:examples`   | Concrete input/output pairs                       | Jest `test("should...")`         |
| `:properties` | Universal invariants (for all valid inputs)       | QuickCheck / fast-check property |
| `:where`      | Trait constraints (interfaces the type must have) | TS `extends` constraint          |


<a id="orgf29f031"></a>

## 3.2 Why This Matters

In JavaScript, these live in *four different places*:

1.  Types: TypeScript `.d.ts` files or inline annotations
2.  Docs: JSDoc comments (often stale)
3.  Examples: Unit tests in a separate `*.test.js` file
4.  Properties: Property-based tests in a third file (if you have them at all)

In Prologos, they're *all part of the spec*. The compiler reads them. The tooling reads them. They're always in sync because they live next to the function they describe.


<a id="orgb461d21"></a>

## 3.3 The Graduation Path

This is the key design philosophy: **you opt in to more precision**. Each level adds information without changing the previous levels:

```prologos
;; Level 0: No types at all. Inference does the work.
defn add [x y] [+ x y]

;; Level 1: Add a type signature.
spec add : Int Int -> Int
defn add [x y] [+ x y]

;; Level 2: Add documentation.
spec add : Int Int -> Int
  :doc "Integer addition"
defn add [x y] [+ x y]

;; Level 3: Add examples.
spec add : Int Int -> Int
  :doc "Integer addition"
  :examples
    - [add 2 3] => 5
defn add [x y] [+ x y]

;; Level 4: Add properties.
spec add : Int Int -> Int
  :doc "Integer addition"
  :examples
    - [add 2 3] => 5
  :properties
    - :name "commutative"
      :holds [eq? [add x y]
                  [add y x]]
    - :name "identity"
      :holds [eq? [add x 0] x]
defn add [x y] [+ x y]
```

At no point do you need to understand dependent types, Pi types, or category theory. You're just adding metadata that the compiler checks.

**The implementation doesn't change.** Only the specification becomes richer.


<a id="org0a619f3"></a>

# Spiral 4: Higher-Kinded Types (Without the Jargon)


<a id="org9ac3d7b"></a>

## 4.1 The Problem: Writing Generic Code Over Containers

You know `map` works on arrays in JavaScript. But what if you want to write a function that works on *any container* &#x2014; arrays, Sets, Maps, async iterables &#x2014; without knowing which one?

In TypeScript, this is awkward. You'd need overloads or a complex generic:

```typescript
// TypeScript: you end up with overloads
function fmap<A, B>(f: (a: A) => B, xs: Array<A>): Array<B>;
function fmap<A, B>(f: (a: A) => B, xs: Set<A>): Set<B>;
// ... one per container type
```
