docs/tutorials/GENTLE_INTRODUCTION_TYPES_SPECS_SESSIONS.org
** 4.2 Prologos: Traits Over Containers

In Prologos, the =Functor= trait captures "any container you can map over":

#+begin_src prologos
spec fmap : [A -> B] -> [F A] -> [F B]
  :where (Functor F)
  :doc "Apply a function inside any container"
#+end_src

Read =F= as "some container type." =F A= means "a container of =A= values."
The =:where (Functor F)= constraint says "=F= must be a type that supports
mapping."

Usage --- zero ceremony:

#+begin_src prologos
fmap inc '[1 2 3]            ;; => '[2 3 4]
fmap inc @[1 2 3]            ;; => @[2 3 4]
fmap to-string '[1 2]        ;; => '["1" "2"]
#+end_src

The compiler sees =F = List= or =F = PVec=, finds the right =Functor=
instance, and dispatches automatically. This is like Rust's trait system
or Haskell's type classes, but with less syntax.

** 4.3 You Already Know This Pattern

If you've used JavaScript's =Symbol.iterator= protocol, you know this idea:

#+begin_src javascript
// JS: any object with [Symbol.iterator] is iterable
for (const x of anyIterable) { ... }
#+end_src

Prologos traits are the typed version of protocols: any type that
implements =Seqable= (the "can produce a sequence" trait) works with
=map=, =filter=, =reduce=, etc. The compiler /proves/ the implementation
exists, rather than discovering at runtime that it doesn't.


* Spiral 5: =functor= --- Naming Complex Types

** 5.1 The Problem: Type Signatures Get Long

As your code becomes more generic, type signatures grow:

#+begin_src prologos
;; This is getting hard to read...
spec compose-xf : <(S :0 Type) -> [S -> B -> S] -> S -> A -> S>
                  -> <(S :0 Type) -> [S -> C -> S] -> S -> B -> S>
                  -> <(S :0 Type) -> [S -> C -> S] -> S -> A -> S>
#+end_src

Those angle brackets =<...>= contain /dependent types/ --- types that
mention runtime values. We'll get to what that means later. For now,
the point is: this signature is unreadable.

** 5.2 The Solution: Name It

#+begin_src prologos
functor Xf {A B : Type}
  :doc "A transducer: transforms A-reductions into B-reductions"
  :unfolds <(S :0 Type) -> [S -> B -> S] -> S -> A -> S>
#+end_src

Now the signature becomes:

#+begin_src prologos
spec compose-xf : [Xf A B] -> [Xf B C] -> [Xf A C]
  :doc "Compose two transducers"
#+end_src

=functor= is Prologos's way of saying: "I'm naming a complex type
pattern so I never have to write out the full thing." It's like
TypeScript's =type= alias on steroids:

#+begin_src typescript
// TypeScript equivalent (roughly)
type Xf<A, B> = <S>(step: (s: S, b: B) => S) => (s: S, a: A) => S;
#+end_src

** 5.3 Progressive Metadata on =functor=

Just like =spec=, =functor= supports progressive metadata:

#+begin_src prologos
functor Xf {A B : Type}
  :doc "A transducer: transforms A-reductions into B-reductions"
  :unfolds <(S :0 Type) -> [S -> B -> S] -> S -> A -> S>
  :compose xf-compose     ;; "this type composes via xf-compose"
  :identity id-xf         ;; "the identity element is id-xf"
  :laws (transducer-laws)  ;; "it must satisfy these algebraic laws"
#+end_src

You don't need =:compose=, =:identity=, or =:laws= to use =functor=.
Start with just =:unfolds=. Add algebraic structure when you need it.

** 5.4 The Key Insight

The dependent type (=<...>=) lives in =:unfolds=, consulted only when
the compiler needs it. The programmer-facing surface is just =Xf A B=.

*Dependent types are the implementation substrate. The surface language
speaks in domain terms.*

This is Prologos's design philosophy in a nutshell. The deep theory is
there when you need it --- but it's behind a door you never have to open
unless you want to.


* Spiral 6: Channels and Protocols (Session Types)

** 6.1 The Problem: Communication Goes Wrong

If you've built distributed services, you know the pain: the client
sends a JSON object, the server expects a different shape, and things
silently break. Or worse: the client sends two messages when the server
expects one, and the connection hangs.

These are /protocol bugs/. TypeScript can't catch them --- the type system
doesn't model sequences of messages. REST API schemas (OpenAPI) are
documentation, not enforcement. gRPC is closer, but still doesn't verify
that your client and server agree on the /order/ of messages.

