docs/tutorials/GENTLE_INTRODUCTION_TYPES_SPECS_SESSIONS.tex
\subsection{4.2 Prologos: Traits Over Containers}
\label{sec:orgda08be5}

In Prologos, the \texttt{Functor} trait captures "any container you can map over":

\begin{verbatim}
spec fmap : [A -> B] -> [F A] -> [F B]
  :where (Functor F)
  :doc "Apply a function inside any container"
\end{verbatim}

Read \texttt{F} as "some container type." \texttt{F A} means "a container of \texttt{A} values."
The \texttt{:where (Functor F)} constraint says "\texttt{F} must be a type that supports
mapping."

Usage --- zero ceremony:

\begin{verbatim}
fmap inc '[1 2 3]            ;; => '[2 3 4]
fmap inc @[1 2 3]           ;; => @[2 3 4]
fmap to-string '[1 2]       ;; => '["1" "2"]
\end{verbatim}

The compiler sees \texttt{F = List} or \texttt{F = PVec}, finds the right \texttt{Functor}
instance, and dispatches automatically. This is like Rust's trait system
or Haskell's type classes, but with less syntax.
\subsection{4.3 You Already Know This Pattern}
\label{sec:org11a12f0}

If you've used JavaScript's \texttt{Symbol.iterator} protocol, you know this idea:

\begin{verbatim}
// JS: any object with [Symbol.iterator] is iterable
for (const x of anyIterable) { ... }
\end{verbatim}

Prologos traits are the typed version of protocols: any type that
implements \texttt{Seqable} (the "can produce a sequence" trait) works with
\texttt{map}, \texttt{filter}, \texttt{reduce}, etc. The compiler \emph{proves} the implementation
exists, rather than discovering at runtime that it doesn't.
\section{Spiral 5: \texttt{functor} --- Naming Complex Types}
\label{sec:org4a11eb2}

\subsection{5.1 The Problem: Type Signatures Get Long}
\label{sec:orgdbcedd1}

As your code becomes more generic, type signatures grow:

\begin{verbatim}
;; This is getting hard to read...
spec compose-xf : <(S :0 Type) -> [S -> B -> S] -> S -> A -> S>
                  -> <(S :0 Type) -> [S -> C -> S] -> S -> B -> S>
                  -> <(S :0 Type) -> [S -> C -> S] -> S -> A -> S>
\end{verbatim}

Those angle brackets \texttt{<...>} contain \emph{dependent types} --- types that
mention runtime values. We'll get to what that means later. For now,
the point is: this signature is unreadable.
\subsection{5.2 The Solution: Name It}
\label{sec:org93dfe4e}

\begin{verbatim}
functor Xf {A B : Type}
  :doc "A transducer: transforms A-reductions into B-reductions"
  :unfolds <(S :0 Type) -> [S -> B -> S] -> S -> A -> S>
\end{verbatim}

Now the signature becomes:

\begin{verbatim}
spec compose-xf : [Xf A B] -> [Xf B C] -> [Xf A C]
  :doc "Compose two transducers"
\end{verbatim}

\texttt{functor} is Prologos's way of saying: "I'm naming a complex type
pattern so I never have to write out the full thing." It's like
TypeScript's \texttt{type} alias on steroids:

\begin{verbatim}
// TypeScript equivalent (roughly)
type Xf<A, B> = <S>(step: (s: S, b: B) => S) => (s: S, a: A) => S;
\end{verbatim}
\subsection{5.3 Progressive Metadata on \texttt{functor}}
\label{sec:org8c6aef3}

Just like \texttt{spec}, \texttt{functor} supports progressive metadata:

\begin{verbatim}
functor Xf {A B : Type}
  :doc "A transducer: transforms A-reductions into B-reductions"
  :unfolds <(S :0 Type) -> [S -> B -> S] -> S -> A -> S>
  :compose xf-compose     ;; "this type composes via xf-compose"
  :identity id-xf         ;; "the identity element is id-xf"
  :laws (transducer-laws)  ;; "it must satisfy these algebraic laws"
\end{verbatim}

You don't need \texttt{:compose}, \texttt{:identity}, or \texttt{:laws} to use \texttt{functor}.
Start with just \texttt{:unfolds}. Add algebraic structure when you need it.
\subsection{5.4 The Key Insight}
\label{sec:orgd46a3eb}

The dependent type (\texttt{<...>}) lives in \texttt{:unfolds}, consulted only when
the compiler needs it. The programmer-facing surface is just \texttt{Xf A B}.

\textbf{Dependent types are the implementation substrate. The surface language
speaks in domain terms.}

This is Prologos's design philosophy in a nutshell. The deep theory is
there when you need it --- but it's behind a door you never have to open
unless you want to.
\section{Spiral 6: Channels and Protocols (Session Types)}
\label{sec:orge5253eb}

\subsection{6.1 The Problem: Communication Goes Wrong}
\label{sec:org8c120c4}

If you've built distributed services, you know the pain: the client
sends a JSON object, the server expects a different shape, and things
silently break. Or worse: the client sends two messages when the server
expects one, and the connection hangs.

These are \emph{protocol bugs}. TypeScript can't catch them --- the type system
doesn't model sequences of messages. REST API schemas (OpenAPI) are
documentation, not enforcement. gRPC is closer, but still doesn't verify
that your client and server agree on the \emph{order} of messages.
