docs/tutorials/GENTLE_INTRODUCTION_TYPES_SPECS_SESSIONS.md


<a id="orgb7bf04c"></a>

## 4.2 Prologos: Traits Over Containers

In Prologos, the `Functor` trait captures "any container you can map over":

```prologos
spec fmap : [A -> B] -> [F A] -> [F B]
  :where (Functor F)
  :doc "Apply a function inside any container"
```

Read `F` as "some container type." `F A` means "a container of `A` values." The `:where (Functor F)` constraint says "`F` must be a type that supports mapping."

Usage &#x2014; zero ceremony:

```prologos
fmap inc '[1 2 3]            ;; => '[2 3 4]
fmap inc @[1 2 3]            ;; => @[2 3 4]
fmap to-string '[1 2]        ;; => '["1" "2"]
```

The compiler sees `F = List` or `F = PVec`, finds the right `Functor` instance, and dispatches automatically. This is like Rust's trait system or Haskell's type classes, but with less syntax.


<a id="org1aded90"></a>

## 4.3 You Already Know This Pattern

If you've used JavaScript's `Symbol.iterator` protocol, you know this idea:

```javascript
// JS: any object with [Symbol.iterator] is iterable
for (const x of anyIterable) { ... }
```

Prologos traits are the typed version of protocols: any type that implements `Seqable` (the "can produce a sequence" trait) works with `map`, `filter`, `reduce`, etc. The compiler *proves* the implementation exists, rather than discovering at runtime that it doesn't.


<a id="orged3df51"></a>

# Spiral 5: `functor` &#x2014; Naming Complex Types


<a id="orgb35964b"></a>

## 5.1 The Problem: Type Signatures Get Long

As your code becomes more generic, type signatures grow:

```prologos
;; This is getting hard to read...
spec compose-xf : <(S :0 Type) -> [S -> B -> S] -> S -> A -> S>
                  -> <(S :0 Type) -> [S -> C -> S] -> S -> B -> S>
                  -> <(S :0 Type) -> [S -> C -> S] -> S -> A -> S>
```

Those angle brackets `<...>` contain *dependent types* &#x2014; types that mention runtime values. We'll get to what that means later. For now, the point is: this signature is unreadable.


<a id="org7966f53"></a>

## 5.2 The Solution: Name It

```prologos
functor Xf {A B : Type}
  :doc "A transducer: transforms A-reductions into B-reductions"
  :unfolds <(S :0 Type) -> [S -> B -> S] -> S -> A -> S>
```

Now the signature becomes:

```prologos
spec compose-xf : [Xf A B] -> [Xf B C] -> [Xf A C]
  :doc "Compose two transducers"
```

`functor` is Prologos's way of saying: "I'm naming a complex type pattern so I never have to write out the full thing." It's like TypeScript's `type` alias on steroids:

```typescript
// TypeScript equivalent (roughly)
type Xf<A, B> = <S>(step: (s: S, b: B) => S) => (s: S, a: A) => S;
```


<a id="org47ae058"></a>

## 5.3 Progressive Metadata on `functor`

Just like `spec`, `functor` supports progressive metadata:

```prologos
functor Xf {A B : Type}
  :doc "A transducer: transforms A-reductions into B-reductions"
  :unfolds <(S :0 Type) -> [S -> B -> S] -> S -> A -> S>
  :compose xf-compose     ;; "this type composes via xf-compose"
  :identity id-xf         ;; "the identity element is id-xf"
  :laws (transducer-laws)  ;; "it must satisfy these algebraic laws"
```

You don't need `:compose`, `:identity`, or `:laws` to use `functor`. Start with just `:unfolds`. Add algebraic structure when you need it.


<a id="orgb9b216c"></a>

## 5.4 The Key Insight

The dependent type (`<...>`) lives in `:unfolds`, consulted only when the compiler needs it. The programmer-facing surface is just `Xf A B`.

**Dependent types are the implementation substrate. The surface language speaks in domain terms.**

This is Prologos's design philosophy in a nutshell. The deep theory is there when you need it &#x2014; but it's behind a door you never have to open unless you want to.


<a id="org8cdf6d9"></a>

# Spiral 6: Channels and Protocols (Session Types)


<a id="orgc7e1c0d"></a>

## 6.1 The Problem: Communication Goes Wrong

If you've built distributed services, you know the pain: the client sends a JSON object, the server expects a different shape, and things silently break. Or worse: the client sends two messages when the server expects one, and the connection hangs.

These are *protocol bugs*. TypeScript can't catch them &#x2014; the type system doesn't model sequences of messages. REST API schemas (OpenAPI) are documentation, not enforcement. gRPC is closer, but still doesn't verify that your client and server agree on the *order* of messages.
