docs/tutorials/GENTLE_INTRODUCTION_TYPES_SPECS_SESSIONS.tex
\subsection{6.2 Session Types: Protocols as Types}
\label{sec:org3c7fbee}

Prologos can express communication protocols \emph{in the type system}:

\begin{verbatim}
;; A session defines the shape of a conversation
session Greeter
  send name : String       ;; client sends a string
  recv greeting : String   ;; client receives a string
  end                      ;; conversation is over
\end{verbatim}

This says: "A \texttt{Greeter} session starts with the client sending a
\texttt{String} (the name), then the server responds with a \texttt{String}
(the greeting), then the conversation ends."

The compiler checks \emph{both sides}:
\begin{itemize}
\item The client must send a \texttt{String} first, then receive a \texttt{String}
\item The server must receive a \texttt{String} first, then send a \texttt{String}
(the \emph{dual} --- send becomes receive, receive becomes send)
\end{itemize}

If either side violates the protocol, it's a \emph{compile-time error}.
\subsection{6.3 Branching Protocols: Choice and Offer}
\label{sec:org277b8af}

Real protocols have branches. Think of an HTTP-like interaction:

\begin{verbatim}
session DatabaseService
  rec Loop                  ;; recursive protocol (can repeat)
    offer                   ;; server offers these choices:
      | :query              ;; client can select :query
          recv q : Query    ;;   send a query
          send r : Result   ;;   get a result back
          Loop              ;;   and go again
      | :close              ;; or client can select :close
          end               ;;   and we're done
\end{verbatim}

The server =offer=s branches; the client =select=s one. This is like a
tagged union of possible message sequences. The compiler verifies that
the server handles every branch the client might choose.
\subsection{6.4 Dependent Sessions: Protocols That Depend on Values}
\label{sec:org29bbc5b}

Here's where Prologos goes beyond what gRPC or OpenAPI can express:

\begin{verbatim}
session VecProtocol (A : Type)
  recv n : Nat             ;; client sends a number
  send v : [Vec A n]       ;; server sends a vector of THAT length
  end
\end{verbatim}

The type of the \emph{second} message depends on the \emph{value} of the first.
If the client sends \texttt{3}, the server must send a vector of length 3. Not
"some vector" --- \emph{exactly} 3 elements. The compiler proves this.

This is a \textbf{dependent session type} --- the protocol shape depends on
runtime values. No mainstream language can express this.
\section{Spiral 7: Capabilities and the Eventual Send}
\label{sec:org19a462a}

\subsection{7.1 A Quick Grounding: What Are Capabilities?}
\label{sec:org86504a3}

Object-capability security (ocap) is a model where authority comes from
\emph{possession of a reference}, not from ambient identity checks (like ACLs
or ambient auth). The idea originates in Mark Miller's E language (2000s)
and is being standardized for decentralized networks by the \href{https://ocapn.org/}{OCapN
pre-standardization group}, with implementations in Spritely Goblins
(Guile Scheme) and the \href{https://github.com/endojs/endo}{Endo} project (JavaScript/Hardened JS).

The core principles:
\begin{itemize}
\item \textbf{No ambient authority}: you can't "import" a database handle from thin
air. Someone must hand you a reference.
\item \textbf{Attenuation}: you can give someone a \emph{weaker} version of your authority
(read-only view, rate-limited proxy, etc.)
\item \textbf{Transfer}: you can pass a capability to someone else — and if it's
unique, passing it means \emph{you no longer have it}.
\item \textbf{Composition}: capabilities are just references — they compose like any
other value.
\end{itemize}

If you've built systems with OAuth tokens, API keys, or dependency
injection, you've been \emph{approximating} ocap informally. The difference is
enforcement: in Prologos, the compiler verifies these properties.
\subsection{7.2 Channels as Capabilities}
\label{sec:org2cd069c}

In Prologos, a typed channel \emph{is} a capability. Consider:

\begin{verbatim}
session ReadOnlyDB
  rec Loop
    offer
      | :query
          recv q : Query
          send r : Result
          Loop
      | :close
          end
\end{verbatim}

If a function receives a channel of type \texttt{ReadOnlyDB}, it can \emph{only}
query and close. It cannot insert, delete, or modify data ---
not because of a runtime ACL check, but because those operations
don't exist in the session type. The \emph{type itself is the attenuation
boundary}.

This maps directly to the ocap principle of attenuation: the
\texttt{ReadOnlyDB} session type is a \emph{powerless facet} of a full
\texttt{DatabaseService} --- same database, smaller authority surface.
\subsection{7.3 Linear Types Prevent Capability Duplication}
\label{sec:orgb22a52e}

Prologos's linear types (QTT --- Quantitative Type Theory) add another
layer. A channel marked with multiplicity \texttt{:1} (linear) cannot be
duplicated:

\begin{verbatim}
;; If db-channel is linear (:1), you cannot do this:
let chan1 = db-channel
let chan2 = db-channel   ;; TYPE ERROR: db-channel already consumed
\end{verbatim}

This means: if I give you my database channel, \emph{I no longer have it}.
That's capability transfer --- enforced by the compiler. No need for
runtime wrappers or trust assumptions.
