docs/tutorials/GENTLE_INTRODUCTION_TYPES_SPECS_SESSIONS.md


<a id="orgc10dc94"></a>

## 6.2 Session Types: Protocols as Types

Prologos can express communication protocols *in the type system*:

```prologos
;; A session defines the shape of a conversation
session Greeter
  send name : String       ;; client sends a string
  recv greeting : String   ;; client receives a string
  end                      ;; conversation is over
```

This says: "A `Greeter` session starts with the client sending a `String` (the name), then the server responds with a `String` (the greeting), then the conversation ends."

The compiler checks *both sides*:

-   The client must send a `String` first, then receive a `String`
-   The server must receive a `String` first, then send a `String` (the *dual* &#x2014; send becomes receive, receive becomes send)

If either side violates the protocol, it's a *compile-time error*.


<a id="org432d56a"></a>

## 6.3 Branching Protocols: Choice and Offer

Real protocols have branches. Think of an HTTP-like interaction:

```prologos
session DatabaseService
  rec Loop                  ;; recursive protocol (can repeat)
    offer                   ;; server offers these choices:
      | :query              ;; client can select :query
          recv q : Query    ;;   send a query
          send r : Result   ;;   get a result back
          Loop              ;;   and go again
      | :close              ;; or client can select :close
          end               ;;   and we're done
```

The server =offer=s branches; the client =select=s one. This is like a tagged union of possible message sequences. The compiler verifies that the server handles every branch the client might choose.


<a id="orgca32668"></a>

## 6.4 Dependent Sessions: Protocols That Depend on Values

Here's where Prologos goes beyond what gRPC or OpenAPI can express:

```prologos
session VecProtocol (A : Type)
  recv n : Nat             ;; client sends a number
  send v : [Vec A n]       ;; server sends a vector of THAT length
  end
```

The type of the *second* message depends on the *value* of the first. If the client sends `3`, the server must send a vector of length 3. Not "some vector" &#x2014; *exactly* 3 elements. The compiler proves this.

This is a **dependent session type** &#x2014; the protocol shape depends on runtime values. No mainstream language can express this.


<a id="org455e98a"></a>

# Spiral 7: Capabilities and the Eventual Send


<a id="org62db3ef"></a>

## 7.1 A Quick Grounding: What Are Capabilities?

Object-capability security (ocap) is a model where authority comes from *possession of a reference*, not from ambient identity checks (like ACLs or ambient auth). The idea originates in Mark Miller's E language (2000s) and is being standardized for decentralized networks by the [OCapN pre-standardization group](https://ocapn.org/), with implementations in Spritely Goblins (Guile Scheme) and the [Endo](https://github.com/endojs/endo) project (JavaScript/Hardened JS).

The core principles:

-   **No ambient authority**: you can't "import" a database handle from thin air. Someone must hand you a reference.
-   **Attenuation**: you can give someone a *weaker* version of your authority (read-only view, rate-limited proxy, etc.)
-   **Transfer**: you can pass a capability to someone else — and if it's unique, passing it means *you no longer have it*.
-   **Composition**: capabilities are just references — they compose like any other value.

If you've built systems with OAuth tokens, API keys, or dependency injection, you've been *approximating* ocap informally. The difference is enforcement: in Prologos, the compiler verifies these properties.


<a id="org723b869"></a>

## 7.2 Channels as Capabilities

In Prologos, a typed channel *is* a capability. Consider:

```prologos
session ReadOnlyDB
  rec Loop
    offer
      | :query
          recv q : Query
          send r : Result
          Loop
      | :close
          end
```

If a function receives a channel of type `ReadOnlyDB`, it can *only* query and close. It cannot insert, delete, or modify data &#x2014; not because of a runtime ACL check, but because those operations don't exist in the session type. The *type itself is the attenuation boundary*.

This maps directly to the ocap principle of attenuation: the `ReadOnlyDB` session type is a *powerless facet* of a full `DatabaseService` &#x2014; same database, smaller authority surface.


<a id="orga9f5586"></a>

## 7.3 Linear Types Prevent Capability Duplication

Prologos's linear types (QTT &#x2014; Quantitative Type Theory) add another layer. A channel marked with multiplicity `:1` (linear) cannot be duplicated:

```prologos
;; If db-channel is linear (:1), you cannot do this:
let chan1 = db-channel
let chan2 = db-channel   ;; TYPE ERROR: db-channel already consumed
```

This means: if I give you my database channel, *I no longer have it*. That's capability transfer &#x2014; enforced by the compiler. No need for runtime wrappers or trust assumptions.
