docs/tutorials/GENTLE_INTRODUCTION_TYPES_SPECS_SESSIONS.tex
\subsection{7.4 The Eventual Send}
\label{sec:org834cbb1}

The \emph{eventual send} is a fundamental concept from Mark Miller's E
language (and now central to OCapN's CapTP --- the Capability Transport
Protocol). The idea: instead of blocking on a remote call, you fire off
a message and get back a \emph{promise}. The remote side processes it
asynchronously. Multiple messages can be in-flight simultaneously.

In JavaScript, this concept is making its way in via the \href{https://github.com/tc39/proposal-eventual-send}{TC39
proposal-eventual-send}, with syntax like \texttt{E(target).method(args)}.

Prologos provides this natively via \texttt{!!} (non-blocking send) and
\texttt{recv!} (non-blocking receive):

\begin{verbatim}
defproc db-client [queries : List Query] : List QueryResult
  let channel = [connect DatabaseService]

  ;; Fire all queries without waiting (eventual sends)
  let promises = [map [fn [q]
    select :query channel
    send q channel
    recv! channel           ;; recv! = eventual receive, returns promise
  ] queries]

  ;; Do other work while queries execute...
  [log "queries submitted, waiting..."]

  ;; Collect all results when ready
  let results = [map await promises]

  select :close channel
  results
\end{verbatim}

The \texttt{recv!} operation returns a promise. Multiple queries fly out
concurrently. \texttt{await} collects the results. The session type \emph{still
guarantees} that every query gets exactly one response --- the protocol
is preserved even in the asynchronous case.

This is analogous to E's \emph{promise pipelining}: rather than waiting for
each round trip, you send all your messages and let the promises resolve
in whatever order the network delivers. The key difference: Prologos's
session type statically proves that the promise chain is well-formed ---
every send has a matching receive, every branch is handled.
\subsection{7.5 How This Compares to OCapN}
\label{sec:org3f771ae}

\begin{center}
\begin{tabular}{lll}
OCapN / E Concept & Prologos Equivalent & Enforcement\\
\hline
Object reference & Typed channel endpoint & Compile-time type\\
Capability attenuation & Session type (can only do what the type says) & Compile-time type\\
No ambient authority & Linear types prevent copying channels & Compile-time QTT\\
Eventual send (\texttt{E(x).m()}) & \texttt{!!} / \texttt{send!} (non-blocking send) & Compile-time type\\
Promise & \texttt{recv!} returns a promise; \texttt{await} resolves & Compile-time type\\
Promise pipelining & Multiple \texttt{recv!} in-flight; session type tracks & Compile-time type\\
Vat (isolated object graph) & Process with linear channel context & Compile-time QTT\\
CapTP (capability transfer) & Channel passing (linear: transfer of authority) & Compile-time QTT\\
Sealer/Unsealer pairs & Existential types (Sigma) — pack/unpack & Compile-time type\\
\end{tabular}
\end{center}

The key difference from existing ocap implementations: in Spritely's
Goblins, capabilities are enforced at \emph{runtime} by the Guile Scheme VM.
In Endo/Hardened JS, they're enforced by the SES (Secure ECMAScript)
sandbox. In Prologos, capabilities are enforced at \emph{compile time} by the
type checker. If your program type checks, protocol violations are
\emph{impossible}. The type system \emph{is} the capability system.

\begin{quote}
"Logos with session types gives you ocap where the capability protocol
is enforced by the compiler, not just convention."
--- from project design discussion
\end{quote}
\section{Spiral 8: Dependent Types (The Deeper Layer)}
\label{sec:org82d25e6}

\subsection{8.1 You've Already Used Them}
\label{sec:org1f40551}

If you read the \texttt{VecProtocol} example above and understood it, you've
already used dependent types. A dependent type is just a type that
mentions a runtime value:

\begin{verbatim}
spec replicate : <(n : Nat) -> A -> [Vec A n]>
\end{verbatim}

"Given a number \texttt{n}, return a vector of \emph{exactly} \texttt{n} elements." The
return type depends on the argument value. That's it. That's a
dependent type.

The angle brackets \texttt{<...>} mark the dependent part. Everything
outside angle brackets is regular ML-style typing. This visual
separator means you can \emph{see} where dependency happens.
