docs/tutorials/GENTLE_INTRODUCTION_TYPES_SPECS_SESSIONS.md


<a id="org628a81a"></a>

## 7.4 The Eventual Send

The *eventual send* is a fundamental concept from Mark Miller's E language (and now central to OCapN's CapTP &#x2014; the Capability Transport Protocol). The idea: instead of blocking on a remote call, you fire off a message and get back a *promise*. The remote side processes it asynchronously. Multiple messages can be in-flight simultaneously.

In JavaScript, this concept is making its way in via the [TC39 proposal-eventual-send](https://github.com/tc39/proposal-eventual-send), with syntax like `E(target).method(args)`.

Prologos provides this natively via `!!` (non-blocking send) and `recv!` (non-blocking receive):

```prologos
defproc db-client [queries : List Query] : List QueryResult
  let channel = [connect DatabaseService]

  ;; Fire all queries without waiting (eventual sends)
  let promises = [map [fn [q]
    select :query channel
    send q channel
    recv! channel           ;; recv! = eventual receive, returns promise
  ] queries]

  ;; Do other work while queries execute...
  [log "queries submitted, waiting..."]

  ;; Collect all results when ready
  let results = [map await promises]

  select :close channel
  results
```

The `recv!` operation returns a promise. Multiple queries fly out concurrently. `await` collects the results. The session type *still guarantees* that every query gets exactly one response &#x2014; the protocol is preserved even in the asynchronous case.

This is analogous to E's *promise pipelining*: rather than waiting for each round trip, you send all your messages and let the promises resolve in whatever order the network delivers. The key difference: Prologos's session type statically proves that the promise chain is well-formed &#x2014; every send has a matching receive, every branch is handled.


<a id="org8201d62"></a>

## 7.5 How This Compares to OCapN

| OCapN / E Concept           | Prologos Equivalent                             | Enforcement       |
|--------------------------- |----------------------------------------------- |----------------- |
| Object reference            | Typed channel endpoint                          | Compile-time type |
| Capability attenuation      | Session type (can only do what the type says)   | Compile-time type |
| No ambient authority        | Linear types prevent copying channels           | Compile-time QTT  |
| Eventual send (`E(x).m()`)  | `!!` / `send!` (non-blocking send)              | Compile-time type |
| Promise                     | `recv!` returns a promise; `await` resolves     | Compile-time type |
| Promise pipelining          | Multiple `recv!` in-flight; session type tracks | Compile-time type |
| Vat (isolated object graph) | Process with linear channel context             | Compile-time QTT  |
| CapTP (capability transfer) | Channel passing (linear: transfer of authority) | Compile-time QTT  |
| Sealer/Unsealer pairs       | Existential types (Sigma) — pack/unpack         | Compile-time type |

The key difference from existing ocap implementations: in Spritely's Goblins, capabilities are enforced at *runtime* by the Guile Scheme VM. In Endo/Hardened JS, they're enforced by the SES (Secure ECMAScript) sandbox. In Prologos, capabilities are enforced at *compile time* by the type checker. If your program type checks, protocol violations are *impossible*. The type system *is* the capability system.

> "Logos with session types gives you ocap where the capability protocol is enforced by the compiler, not just convention." &#x2014; from project design discussion


<a id="org2e02c71"></a>

# Spiral 8: Dependent Types (The Deeper Layer)


<a id="org9b5cdcd"></a>

## 8.1 You've Already Used Them

If you read the `VecProtocol` example above and understood it, you've already used dependent types. A dependent type is just a type that mentions a runtime value:

```prologos
spec replicate : <(n : Nat) -> A -> [Vec A n]>
```

"Given a number `n`, return a vector of *exactly* `n` elements." The return type depends on the argument value. That's it. That's a dependent type.

The angle brackets `<...>` mark the dependent part. Everything outside angle brackets is regular ML-style typing. This visual separator means you can *see* where dependency happens.
