docs/tutorials/GENTLE_INTRODUCTION_TYPES_SPECS_SESSIONS.org
** 8.2 The Full Progressive Complexity Ladder

Let's revisit the levels, now that you have the intuition:

| Level | What You Write                        | What It Means                      | TypeScript Analogy          |
|-------+---------------------------------------+------------------------------------+-----------------------------|
|     0 | =defn add [x y] [+ x y]=             | No types (inference)               | TS with =any=               |
|     1 | =spec add : Int -> Int -> Int=        | Concrete types                     | =function add(x: number)=  |
|     2 | =spec id : A -> A=                    | Generics                           | =function id<A>(x: A): A=  |
|     3 | =spec sort : ... :where (Ord A)=      | Constrained generics               | =<A extends Comparable>=   |
|     4 | =spec fmap : ... :where (Functor F)=  | Higher-kinded generics             | No TS equivalent            |
|     5 | =functor Xf {A B} :unfolds ...=       | Named type abstractions            | =type Xf<A,B> = ...=       |
|     6 | =spec replicate : <(n : Nat) -> ...>= | Dependent types (Pi)               | No TS equivalent            |
|     7 | =spec filter : ... <result * proof>=  | Dependent pairs (Sigma/existential)| No TS equivalent            |

Levels 0-3 are familiar territory for any TypeScript developer. Level 4
is where Prologos starts going beyond what mainstream languages offer.
Levels 5-7 are opt-in power tools.

*You never have to leave the level you're comfortable at.* Code at
Level 1 and code at Level 7 coexist in the same codebase, call each
other, and are type-checked together.

** 8.3 =??= : The "What Goes Here?" Hole

When working with complex types, Prologos provides typed holes --- write
=??= where you don't know what to put, and the compiler tells you
what type it expects:

#+begin_src prologos
defn zip-with
  | [f vnil _]             -> vnil
  | [f _ vnil]             -> ??           ;; What goes here?
  | [f (vcons x xs) (vcons y ys)]
      -> [vcons [f x y] [zip-with f xs ys]]
#+end_src

The compiler responds:

#+begin_example
  Hole ?? at line 3
  Expected type: Vec B 0
  In context:
    f  : A -> A -> B
    xs : Vec A (suc n)
    ys : Vec A 0
  Hint: The only value of type Vec B 0 is vnil
#+end_example

This is /interactive type-driven development/. The types guide you toward
the correct implementation. Start with holes, let the compiler fill in
the blanks. It's like pair programming with the type checker.


* Spiral 9: The Big Picture --- =spec=, =functor=, =session=

** 9.1 The Keyword Symmetry

Prologos has a deliberate symmetry in its specification language:

| Keyword    | What It Describes                     | Analogy                          |
|------------+---------------------------------------+----------------------------------|
| =spec=     | Function type + metadata              | TypeScript function signature    |
| =trait=    | A method that types must implement    | TypeScript/Java interface method |
| =bundle=   | A group of traits (AND conjunction)   | =extends A & B & C=             |
| =property= | A group of testable invariants        | QuickCheck property suite        |
| =functor=  | A named, reusable type pattern        | TypeScript =type= alias (richer) |
| =session=  | A communication protocol              | gRPC service definition (richer) |

** 9.2 They All Compose

The keywords aren't isolated features --- they build on each other:

#+begin_src prologos
;; A property group
property transducer-laws {A B C : Type}
  :holds [eq? [compose-xf id-xf xf] xf]       ;; identity law
  :holds [eq? [compose-xf [compose-xf f g] h]
               [compose-xf f [compose-xf g h]]] ;; associativity

;; A type abstraction
functor Xf {A B : Type}
  :doc "A transducer"
  :unfolds <(S :0 Type) -> [S -> B -> S] -> S -> A -> S>
  :compose xf-compose
  :identity id-xf
  :laws (transducer-laws)

;; A function spec using the above
spec map-xf : [A -> B] -> [Xf A B]
  :doc "Transducer that applies f to each element"
  :examples
    - [into-list [map-xf inc] '[1 2 3]] => '[2 3 4]

;; A trait using all of the above
trait Transducible {C : Type -> Type}
  :laws (transducer-fusion C)
  to-xf : {A B : Type} -> [A -> B] -> [Xf A B]
#+end_src

*The =functor= names the type. The =property= states its laws. The
=spec= uses both. The =trait= packages it for generic dispatch.
Everything is readable. The dependent types are present exactly once,
in =:unfolds=, consulted only when needed.*


* Where To Go From Here

