docs/tutorials/GENTLE_INTRODUCTION_TYPES_SPECS_SESSIONS.tex
\subsection{8.2 The Full Progressive Complexity Ladder}
\label{sec:org198e29e}

Let's revisit the levels, now that you have the intuition:

\begin{center}
\begin{tabular}{rlll}
Level & What You Write & What It Means & TypeScript Analogy\\
\hline
0 & \texttt{defn add [x y] [+ x y]} & No types (inference) & TS with \texttt{any}\\
1 & \texttt{spec add : Int -> Int -> Int} & Concrete types & \texttt{function add(x: number)}\\
2 & \texttt{spec id : A -> A} & Generics & \texttt{function id<A>(x: A): A}\\
3 & \texttt{spec sort : ... :where (Ord A)} & Constrained generics & \texttt{<A extends Comparable>}\\
4 & \texttt{spec fmap : ... :where (Functor F)} & Higher-kinded generics & No TS equivalent\\
5 & \texttt{functor Xf \{A B\} :unfolds ...} & Named type abstractions & \texttt{type Xf<A,B> = ...}\\
6 & \texttt{spec replicate : <(n : Nat) -> ...>} & Dependent types (Pi) & No TS equivalent\\
7 & \texttt{spec filter : ... <result * proof>} & Dependent pairs (Sigma/existential) & No TS equivalent\\
\end{tabular}
\end{center}

Levels 0-3 are familiar territory for any TypeScript developer. Level 4
is where Prologos starts going beyond what mainstream languages offer.
Levels 5-7 are opt-in power tools.

\textbf{You never have to leave the level you're comfortable at.} Code at
Level 1 and code at Level 7 coexist in the same codebase, call each
other, and are type-checked together.
\subsection{8.3 \texttt{??} : The "What Goes Here?" Hole}
\label{sec:org7f36f26}

When working with complex types, Prologos provides typed holes --- write
\texttt{??} where you don't know what to put, and the compiler tells you
what type it expects:

\begin{verbatim}
defn zip-with
  | [f vnil _]             -> vnil
  | [f _ vnil]             -> ??           ;; What goes here?
  | [f (vcons x xs) (vcons y ys)]
      -> [vcons [f x y] [zip-with f xs ys]]
\end{verbatim}

The compiler responds:

\begin{verbatim}
Hole ?? at line 3
Expected type: Vec B 0
In context:
  f  : A -> A -> B
  xs : Vec A (suc n)
  ys : Vec A 0
Hint: The only value of type Vec B 0 is vnil
\end{verbatim}

This is \emph{interactive type-driven development}. The types guide you toward
the correct implementation. Start with holes, let the compiler fill in
the blanks. It's like pair programming with the type checker.
\section{Spiral 9: The Big Picture --- \texttt{spec}, \texttt{functor}, \texttt{session}}
\label{sec:orgfe0b6f9}

\subsection{9.1 The Keyword Symmetry}
\label{sec:org1d9070c}

Prologos has a deliberate symmetry in its specification language:

\begin{center}
\begin{tabular}{lll}
Keyword & What It Describes & Analogy\\
\hline
\texttt{spec} & Function type + metadata & TypeScript function signature\\
\texttt{trait} & A method that types must implement & TypeScript/Java interface method\\
\texttt{bundle} & A group of traits (AND conjunction) & \texttt{extends A \& B \& C}\\
\texttt{property} & A group of testable invariants & QuickCheck property suite\\
\texttt{functor} & A named, reusable type pattern & TypeScript \texttt{type} alias (richer)\\
\texttt{session} & A communication protocol & gRPC service definition (richer)\\
\end{tabular}
\end{center}
\subsection{9.2 They All Compose}
\label{sec:org8cc0494}

The keywords aren't isolated features --- they build on each other:

\begin{verbatim}
;; A property group
property transducer-laws {A B C : Type}
  :holds [eq? [compose-xf id-xf xf] xf]       ;; identity law
  :holds [eq? [compose-xf [compose-xf f g] h]
               [compose-xf f [compose-xf g h]]] ;; associativity

;; A type abstraction
functor Xf {A B : Type}
  :doc "A transducer"
  :unfolds <(S :0 Type) -> [S -> B -> S] -> S -> A -> S>
  :compose xf-compose
  :identity id-xf
  :laws (transducer-laws)

;; A function spec using the above
spec map-xf : [A -> B] -> [Xf A B]
  :doc "Transducer that applies f to each element"
  :examples
    - [into-list [map-xf inc] '[1 2 3]] => '[2 3 4]

;; A trait using all of the above
trait Transducible {C : Type -> Type}
  :laws (transducer-fusion C)
  to-xf : {A B : Type} -> [A -> B] -> [Xf A B]
\end{verbatim}

\textbf{The \texttt{functor} names the type. The \texttt{property} states its laws. The
\texttt{spec} uses both. The \texttt{trait} packages it for generic dispatch.
Everything is readable. The dependent types are present exactly once,
in \texttt{:unfolds}, consulted only when needed.}
\section{Where To Go From Here}
\label{sec:orgc02717d}
