docs/tutorials/GENTLE_INTRODUCTION_TYPES_SPECS_SESSIONS.tex

\subsection{The Progressive Complexity Promise}
\label{sec:org7e8ecd6}

Prologos is designed so that:

\begin{enumerate}
\item A developer who uses Level 0-2 (no types or simple generics) is
productive immediately
\item A developer who uses Level 3-4 (traits + higher-kinded types) writes
highly reusable library code
\item A developer who uses Level 5-7 (functors + dependent types) writes
code with compiler-verified correctness guarantees
\item A developer who uses session types writes distributed systems where
protocol violations are compile-time errors
\item A developer who uses linear types writes capability-secure code where
authority is tracked by the compiler
\end{enumerate}

All five levels coexist. Code at any level can call code at any other
level. The type checker handles the complexity; you choose how much
specification you want to write.

\begin{quote}
"Dependent types are the fabric upon which everything is built --- and
can be reached for in pure form if ever needed --- but otherwise use
\texttt{functor}, \texttt{spec}, etc., with their implicit maps."
\end{quote}
\section{Further Reading}
\label{sec:org8d346bf}

\subsection{Prologos Design Documents}
\label{sec:org08f4865}

\begin{itemize}
\item \texttt{docs/tracking/2026-02-22\_EXTENDED\_SPEC\_DESIGN.md} --- the full \texttt{spec=/=functor=/=property} design (the document that inspired this tutorial)
\item \texttt{docs/tracking/principles/LANGUAGE\_VISION.md} --- the overall vision
\item \texttt{docs/otto\_conversation.org} --- a conversation exploring session types, OCapN, and capabilities in depth
\end{itemize}
\subsection{The Codebase}
\label{sec:org7457e98}

\begin{itemize}
\item \texttt{lib/prologos/core/} --- trait definitions and standard library
\item \texttt{lib/prologos/data/} --- collection types (List, PVec, Map, Set)
\item \texttt{tests/} --- comprehensive tests showing every feature in action
\item \texttt{docs/spec/grammar.ebnf} --- the formal grammar of the language
\end{itemize}
\subsection{Capability-Based Security}
\label{sec:org316193d}

\begin{itemize}
\item \href{https://ocapn.org/}{OCapN Pre-standardization Group} --- the community defining decentralized capability networking
\item \href{https://github.com/ocapn/ocapn/blob/main/draft-specifications/CapTP\%20Specification.md}{CapTP Draft Specification} --- the wire protocol for capability transfer between machines
\item \href{https://spritely.institute/files/docs/guile-goblins/0.10/OCapN-The-Object-Capabilities-Network.html}{Spritely Goblins OCapN Docs} --- reference implementation in Guile Scheme
\item \href{https://github.com/endojs/endo}{Endo / Hardened JavaScript} --- JavaScript-native ocap (SES, eventual send, Agoric)
\item \href{https://github.com/tc39/proposal-eventual-send}{TC39 Proposal: Eventual Send} --- bringing E-style eventual send to JavaScript
\item \href{https://github.com/dckc/awesome-ocap}{Awesome Object Capabilities} --- curated reading list on the ocap model
\item Mark S. Miller, \emph{Robust Composition: Towards a Unified Approach to Access Control and Concurrency Control} (2006) --- the foundational dissertation on E and capabilities
\end{itemize}
\end{document}
